       IDENTIFICATION DIVISION.
       PROGRAM-ID. CEASER-CIPHER.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 User-String  PIC A(50).
